In [1]:
# Imports
from math import sqrt
from scipy import stats
from pydataset import data
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [51]:
# import attendance data
attendance_df = pd.read_csv('untidy-data/attendance.csv')

In [25]:
attendance_df

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [56]:
# rename 'Unnamed: 0' column to 'name'
attendance_df = attendance_df.rename(columns = {'Unnamed: 0': 'name'})

In [70]:
# melt the days using attendace status as value
df_melt = attendance_df.melt(id_vars=['name'], var_name='day', value_name='status')
df_melt.head()

    name         day status
0  Sally  2018-01-01      P
1   Jane  2018-01-01      A
2  Billy  2018-01-01      A
3   John  2018-01-01      P
4  Sally  2018-01-02      T

In [71]:
# replace status alpha values with numerics
df_melt['status'] = df_melt['status'].replace({'T':0.9, 'P':1, 'A':0.0, 'H':0.5})

In [74]:
df_melt.head()

    name         day  status
0  Sally  2018-01-01     1.0
1   Jane  2018-01-01     0.0
2  Billy  2018-01-01     0.0
3   John  2018-01-01     1.0
4  Sally  2018-01-02     0.9

In [76]:
# groupby to aggregate values and determine attendance days
df_melt.groupby(by=['name']).mean()

       status
name
Billy  0.5250
Jane   0.6875
John   0.9125
Sally  0.7625